
// Вызывается из обработчика ОбработкаОповещения формы ПечатьДокументов.
// Позволяет реализовать обработчик внешнего события в форме.
//
// Параметры:
//  Форма      - ФормаКлиентскогоПриложения - форма ОбщаяФорма.ПечатьДокументов.
//  ИмяСобытия - Строка - идентификатор оповещения.
//  Параметр   - СписокЗначений - в Представлении наименование табличного документа (ПФ)
//  Источник   - СписокЗначений - в Значении документ ссылка
//
&Перед("ПечатьДокументовОбработкаОповещения")
Процедура PEN006_ПечатьДокументовОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТабличныеДокументыНапечатаны" Тогда
		Если ТипЗнч(Параметр) = Тип("СписокЗначений") И Параметр.Количество() > 0 Тогда
			Если Параметр[0].Представление = "Конверт" Тогда
				Если ТипЗнч(Источник) = Тип("СписокЗначений") И Источник.Количество() > 0 Тогда
					
					мДокументы = Новый Массив();
					Для каждого элементСЗ Из Источник Цикл
						Если ТипЗнч(элементСЗ.Значение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
							мДокументы.Добавить(элементСЗ.Значение);
						КонецЕсли;
					КонецЦикла;
					
					Если мДокументы.Количество() > 0 Тогда
						PEN006_ОбщийМодульВызовСервера.PEN006_ЗаполнитьДатаПечатиКонверта_РТУ(мДокументы);
						Оповестить("ИзмененСтатусДокументов", мДокументы);
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
