#Область После_отправки_email

// после отправки письма - процедура обратного вызова
// см расширение общего модуля ОтправкаПочтовыхСообщенийКлиент - PEN006_ОтправитьПоЭлектроннойПочте
//
// Параметры:
//  Результат	 - Строка - "ПочтовоеСообщениеОтправлено" или Неопределено
//  стПараметры	 - Структура - 
//
Процедура PEN006_ПослеОтправкиПисьма(Результат, стПараметры) Экспорт
	Перем РезультатУспех;
	
	// Литерал принудительно указан в расширении общей формы ОтправкаСообщенияБП
	// Модуль формы - PEN006_ОтправитьПисьмоВместо Метод Закрыть()
	РезультатУспех = "ПочтовоеСообщениеОтправлено";
	
	Если Результат = РезультатУспех Тогда
		PEN006_ОбщийМодульВызовСервера.PEN006_ЗаполнитьДатаОтправкиEMail(стПараметры.ОбъектыОтправки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
