
&НаКлиенте
Процедура PEN006_ОтправитьПисьмоВместо(Команда)
	
	ОчиститьСообщения();
	ЕстьОшибочныеПолучатели = Ложь;
	Если ПоляЗаполненыКорректно() И ОтправитьПочтовоеСообщение(ЕстьОшибочныеПолучатели) Тогда
		СохранитьАдресОтвета(АдресОтвета);
		ТребуетсяПодтверждениеЗакрытияФормы = Ложь;
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Сообщение отправлено:'"), ,
			?(ПустаяСтрока(ТемаПисьма), НСтр("ru = '<Без темы>'"), ТемаПисьма), БиблиотекаКартинок.Информация32);
		
		Если ЕстьОшибочныеПолучатели Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Письмо отправлено не всем получателям.'"));
		Иначе
			// { PEN 02.06.2021 # $ Передача результата закрытия
			//Закрыть();
			Закрыть("ПочтовоеСообщениеОтправлено");
			// PEN }
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
